HiD/_posts/linux/2012-12-05-github-do-not-support-jekyll-plugin.html
---
layout: tech-post
title: github 不支持 jekyll 插件的解决方法
category: linux
change_frequency: monthly
---


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 问题描述</a></li>
<li><a href="#sec-2">2 解决方法:</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-3">
<h3 id="sec-1">问题描述</h3>
<div class="outline-text-3" id="text-1">


<p>
为了能够利用jekyll生成blog的文章分类列表.经过网上搜索，得知需要使用插件，使用方法是在jekyll的目录
下面建立<sub>plugins目录，里面放置插件，jekyll会自动调用</sub>.
</p>
<p>
可惜的是github.com并不支持jekyll的插件功能，所以一番折腾白费.
</p>
<p>
解决方法只有在本地jekyll生成静态页面后再git push到github.com.
</p>
<p>
github.com约定如果master分支的根目录下有 <b>.nojekyll</b> 这个文件，就对该目录不做jekyll处理，
直接作为静态页面输出。
</p>
</div>

</div>

<div id="outline-container-2" class="outline-3">
<h3 id="sec-2">解决方法:</h3>
<div class="outline-text-3" id="text-2">

<ol>
<li>建立2个分支：dev和master

<p>
   dev 放置原始文件，供jekyll转换使用，master分支放置jekyll生成的静态页面.
</p></li>
<li>在本地搭建jekyll环境,git clone blog网站的内容到本地
<ol>
<li>切换到dev分支写文章:  



<pre class="src src-sh">git checkout dev      
</pre>

</li>
<li>写文章，写好文章后:  



<pre class="src src-sh">jekyll --server --auto       
</pre>

</li>
<li>在本地浏览器访问看一切正常后.  

<p>
      提交新文章到库
</p>


<pre class="src src-sh">git commit -am <span style="color: #ffa500;">'---&#28155;&#21152;&#25991;&#31456;---'</span>      
</pre>

</li>
<li>提交静态页面到master分支  



<pre class="src src-sh"><span style="color: #ffa07a;">commitID</span>=$(<span style="color: #fa8072;">echo</span> <span style="color: #ffa500;">"--&#28155;&#21152;&#26032;&#25991;&#31456;--"</span> | git commit-tree dev^{tree}:_site)
git update-ref refs/heads/master $<span style="color: #ffa07a;">commitID</span>
git checkout master
git push -f origin master
</pre>

</li>
</ol>

</li>
</ol>

</div>
</div>
